/*
验证正则
*/
export default [
  // 手机号
  {
    'phone': /^[1][3,4,5,7,8][0-9]{9}$/, // 因验证器提取枚举，验证类型必须为第一行位置
    'label': '手机号'
  },
  // 邮箱
  {
    'email': /^[a-zA-Z\d]+([-_\.][a-zA-Z\d]+)*@[a-zA-Z\d]+\.[a-zA-Z\d]{2,4}$/,
    'label': '邮箱'
  },
  // 身份证
  {
    'IDCard': /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,
    'label': '身份证号'
  },
  // 数字
  {
    'number': /^[0-9]*$/,
    'label': '数字'
  },
  // 整型
  {
    'integer': /^[+|-]?(0|[1-9])*[0-9]*$/,
    'label': '整型数字'
  },
  // 正整数
  {
    'apn': /^[1-9]|[1-9][0-9]*$/,
    'label': '正整数'
  },
  // 负整数
  {
    'nn': /^-([1-9]|[1-9][0-9])*$/,
    'label': '负整数'
  },
  // url
  {
    'url': /^((ht|f)tps?):\/\/[\w\-]+(\.[\w\-]+)+([\w\-.,@?^=%&:\/~+#]*[\w\-@?^=%&\/~+#])?$/,
    'label': 'URL'
  },
  // 

]